In [1]:
import numpy as np

In [35]:
a=np.array([[1,6],[2,8],[3,11],[3,10],[1,7]])
mean_a= np.zeros(2,)
np.mean(a, axis = 0, out = mean_a)

array([2. , 8.4])

In [36]:
a_centered=a-mean_a

In [37]:
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

In [38]:
a_centered=np.subtract(a,mean_a)

In [39]:
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

In [46]:
a_centered_sp=np.dot(a_centered[:,0],a_centered[:,1])

In [47]:
a_centered_sp

8.0

In [48]:
a_centered_sp/(5-1)

2.0

### Вариант расчета2

In [49]:
a_cov=np.cov(a.transpose())
a_cov[0,1]

2.0

# PANDAS

In [50]:
import pandas as pd

In [60]:
authors = pd.DataFrame({'author_id':[1, 2, 3],
                        'author_name':['Тургенев', 'Чехов', 'Островский']})

In [61]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [62]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                    'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                    'price':[450, 300, 350, 500, 450, 370, 290]})

In [63]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [66]:
authors_price = pd.merge(authors,book,on='author_id',how='left')

In [67]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [69]:
authors_price=authors_price.sort_values(by='price')

In [70]:
authors_price

   author_id author_name            book_title  price
6          3  Островский  Таланты и поклонники    290
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
5          3  Островский                 Гроза    370
0          1    Тургенев           Отцы и дети    450
4          2       Чехов       Дама с собачкой    450
3          2       Чехов      Толстый и тонкий    500

In [71]:
top5 = authors_price.nlargest(5,'price')

In [72]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [77]:
authors_stat=authors_price.groupby('author_name').agg({'price':['min','max','mean']})

In [78]:
authors_stat

            price
              min  max        mean
author_name
Островский    290  370  330.000000
Тургенев      300  450  366.666667
Чехов         450  500  475.000000

In [80]:
authors_stat.columns = ['_'.join(col).strip() for col in authors_stat.columns.values]

In [81]:
authors_stat

             price_min  price_max  price_mean
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

In [82]:
authors_stat = authors_stat.reset_index()

In [83]:
authors_stat

  author_name  price_min  price_max  price_mean
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

In [84]:
cover=pd.DataFrame({'cover':['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']})

In [85]:
cover

     cover
0  твердая
1   мягкая
2   мягкая
3  твердая
4  твердая
5   мягкая
6   мягкая

In [87]:
authors_price=pd.concat([authors_price,cover], axis=1)

In [88]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [90]:
?pd.pivot_table

In [92]:
book_info=pd.pivot_table(authors_price,values='price',index=['author_name'],columns=['cover'],aggfunc=np.sum,fill_value=0)

In [93]:
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [95]:
book_info.to_pickle('book_info.pkl')

In [96]:
book_info2=pd.read_pickle('book_info.pkl')

In [97]:
book_info2

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [100]:
print(book_info == book_info2)

cover        мягкая  твердая
author_name
Островский     True     True
Тургенев       True     True
Чехов          True     True